app/Controllers/Home.php

    public function index()
    {
        $ServiceModel = new ServiceModel();
        $data['services'] = $ServiceModel->findAll();
---
SELECT *
FROM `tbl_service`

    public function produk()
    {
        $ServiceModel = new ServiceModel();
        $data['services'] = $ServiceModel->findAll();
---
SELECT *
FROM `tbl_service`

    public function servis()
    {
        $ServiceModel = new ServiceModel();
        $data['service'] = $ServiceModel->findAll();

        $GroomingModel = new GroomingModel();
        $data['grooming'] = $GroomingModel->findAll();

        $HargaGroomingModel = new HargaGroomingModel();
        $data2['harga_grooming'] = $HargaGroomingModel->findAll();

        $GalleryModel = new GalleryModel();
        $data3['gallery'] = $GalleryModel->findAll();
---
SELECT *
FROM `tbl_service`
SELECT *
FROM `tbl_grooming`
SELECT *
FROM `tbl_harga_grooming`
SELECT *
FROM `tbl_gallery`

    public function shampo()
    {
        $ShampoModel = new ShampoModel();
        $data['shampo'] = $ShampoModel->findAll();
---
SELECT *
FROM `tbl_shampo`

    public function masuk()
    {
        $users = new MemberModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([
            'username' => $username,
        ])->first();
---
SELECT *
FROM `tbl_member`
WHERE `username` = 'arinka'
 LIMIT 1